[
    {
        "uid": "779",
        "question": "Count the awards given to the recepients of the Becket fund for religious liberty.",
        "verbalized_answer": "There are [12] awards of the people whose one award is Becket Fund for Religious Liberty.",
        "query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/Becket_Fund_for_Religious_Liberty> . ?x <http://dbpedia.org/property/awards> ?uri  . }"
    },
    {
        "uid": "2314",
        "question": "What is a salthill?",
        "verbalized_answer": "Salthill is an area in [Galway].",
        "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Salthill> <http://dbpedia.org/ontology/type> ?uri }"
    },
    {
        "uid": "309",
        "question": "Give me a count of everything under the archipelago, where Papeete is the biggest town.",
        "verbalized_answer": "There are [14] things whose archipelago's largest city is Papeete.",
        "query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/largestCity> <http://dbpedia.org/resource/Papeete> . ?uri <http://dbpedia.org/property/archipelago> ?x  . }"
    },
    {
        "uid": "877",
        "question": "Count all the things licensed as Software as a service.",
        "verbalized_answer": "There are [33] things whose content license is Software as a service.",
        "query": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <http://dbpedia.org/ontology/license> <http://dbpedia.org/resource/Software_as_a_service>  . }"
    },
    {
        "uid": "1688",
        "question": "Count all the places where companies located in Ontario operate.",
        "verbalized_answer": "There are [29] locations of the companies which are located in Ontario.",
        "query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/locationCity> <http://dbpedia.org/resource/Ontario> . ?x <http://dbpedia.org/property/locations> ?uri  . }"
    },
    {
        "uid": "2512",
        "question": "Name a few who live in a place where Indian English is an official language",
        "verbalized_answer": "The people whose residence's official language is Indian English are [answer].",
        "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/officialLanguage> <http://dbpedia.org/resource/Indian_English> . ?uri <http://dbpedia.org/ontology/residence> ?x  . }"
    },
    {
        "uid": "4299",
        "question": "Count the different religions followed by Second Lieutenants in military.",
        "verbalized_answer": "There are [30] different religions Second lieutenant follows in millitary.",
        "query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/militaryRank> <http://dbpedia.org/resource/Second_lieutenant> . ?x <http://dbpedia.org/ontology/religion> ?uri  . }"
    },
    {
        "uid": "2265",
        "question": "In which movies has momoko kochi acted",
        "verbalized_answer": "The movies where Momoko Kochi acted are [Godzilla (1954 film), Half Human, Godzilla, King of the Monsters!].",
        "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/starring> <http://dbpedia.org/resource/Momoko_Kōchi> }"
    },
    {
        "uid": "1207",
        "question": "Is lion an animal?",
        "verbalized_answer": "[Yes], lion belongs to the animal kingdom.",
        "query": "ASK WHERE { <http://dbpedia.org/resource/Lion> <http://dbpedia.org/ontology/kingdom> <http://dbpedia.org/resource/Animal> }"
    },
    {
        "uid": "1587",
        "question": "Count the different alma maters of people employed by the CNN.",
        "verbalized_answer": "There are [9] alma maters of the people who work for CNN.",
        "query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/employer> <http://dbpedia.org/resource/CNN> . ?x <http://dbpedia.org/ontology/almaMater> ?uri  . }"
    },
    {
        "uid": "2667",
        "question": "Which silver medalist of the Tennis at the 2012 Summer Olympics Men's singles was also the flagbearer of Switzerland at the 2008 Summer Olympics",
        "verbalized_answer": "The silver medalist of the Tennis at the 2012 Summer Olympics Men's singles and flagbearer of Switzerland at the 2008 Summer Olympics is [Roger Federer].",
        "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Tennis_at_the_2012_Summer_Olympics_–_Men's_singles> <http://dbpedia.org/ontology/silverMedalist> ?uri. <http://dbpedia.org/resource/Switzerland_at_the_2008_Summer_Olympics> <http://dbpedia.org/property/flagbearer> ?uri}"
    },
    {
        "uid": "617",
        "question": "What has been founded in the state that Denton county, Texas is a part of? ",
        "verbalized_answer": "The companies founded in part of Denton County, Texas are [answer].",
        "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/part> <http://dbpedia.org/resource/Denton_County,_Texas> . ?uri <http://dbpedia.org/ontology/foundationPlace> ?x  . }"
    },
    {
        "uid": "4825",
        "question": "Which river goes through cohoes, NY",
        "verbalized_answer": "The river of Cohoes, New York are [Hudson River, Mohawk River].",
        "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Cohoes,_New_York> <http://dbpedia.org/ontology/river> ?uri }"
    },
    {
        "uid": "1472",
        "question": "Count the different causes of death of Christians.",
        "verbalized_answer": "There are [26] different death causes of Christian people.",
        "query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/religion> <http://dbpedia.org/resource/Christianity> . ?x <http://dbpedia.org/ontology/deathCause> ?uri  . }"
    },
    {
        "uid": "129",
        "question": "What newspapers's owners is Schibsted",
        "verbalized_answer": "The newspapers with Schibsted as owner are [Svenska Dagbladet, Aftenposten, Aftonbladet, Fædrelandsvennen, Verdens Gang].",
        "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/owners> <http://dbpedia.org/resource/Schibsted>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Newspaper>}"
    },
    {
        "uid": "226",
        "question": "Who is the performer of album which has the song \"To Where You Are\" ?",
        "verbalized_answer": "The performer of the album which has the song To Where You Are is [Josh Groban].",
        "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/To_Where_You_Are> <http://dbpedia.org/ontology/album> ?x . ?x <http://dbpedia.org/ontology/artist> ?uri  . }"
    },
    {
        "uid": "4073",
        "question": "Give me the number of home stadiums of teams managed by John Spencer.",
        "verbalized_answer": "There are [8] home stadiums of the team managed by John Spencer.",
        "query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/manager> <http://dbpedia.org/resource/John_Spencer_(Scottish_footballer)> . ?x <http://dbpedia.org/ontology/homeStadium> ?uri  . }"
    },
    {
        "uid": "128",
        "question": "Did Steve Sampson manage a club of Santa Clara university",
        "verbalized_answer": "[Yes], Santa Clara University club has been managed by Steve Sampson.",
        "query": "ASK WHERE { <http://dbpedia.org/resource/Steve_Sampson> <http://dbpedia.org/ontology/managerClub> <http://dbpedia.org/resource/Santa_Clara_University> }"
    },
    {
        "uid": "4842",
        "question": "Which famous political figure appointed william cushing, and also founded Pittsburgh>",
        "verbalized_answer": "[George Washington] is the founders of the Pittsburgh and appointer of William Cushing.",
        "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Pittsburgh> <http://dbpedia.org/ontology/founder> ?uri. <http://dbpedia.org/resource/William_Cushing> <http://dbpedia.org/ontology/appointer> ?uri}"
    },
    {
        "uid": "2159",
        "question": "List the awards won by the wife of Ingrid von Rosen.",
        "verbalized_answer": "The awards of the wife of Ingrid von Rosen are [Academy Awards, Goethe Prize, Praemium Imperiale].",
        "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ingrid_von_Rosen> <http://dbpedia.org/property/spouse> ?x . ?x <http://dbpedia.org/property/awards> ?uri  . }"
    },
    {
        "uid": "2710",
        "question": "Count the different religions practiced by people who are in the Malaysian and Chinese association.",
        "verbalized_answer": "There are [23] religions of the people who are members of the Malaysian Chinese Association party.",
        "query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/party> <http://dbpedia.org/resource/Malaysian_Chinese_Association> . ?x <http://dbpedia.org/ontology/religion> ?uri  . }"
    },
    {
        "uid": "92",
        "question": "How many total religions are followed by people whose hometown is somewhere in India?",
        "verbalized_answer": "There are [34] religions followed by people whose hometown is somewhere in India?",
        "query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/hometown> <http://dbpedia.org/resource/India> . ?x <http://dbpedia.org/property/religion> ?uri  . }"
    },
    {
        "uid": "4838",
        "question": "Which company's division is Audi India? Correct Question",
        "verbalized_answer": "[Audi] is the company whose divisions is Audi India.",
        "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/divisions> <http://dbpedia.org/resource/Audi_India> }"
    },
    {
        "uid": "463",
        "question": "Name the members of youth clubs which have Camp Nou as their homeground.",
        "verbalized_answer": "The members whose youth clubs ground is Camp Nou are [answer].",
        "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/ground> <http://dbpedia.org/resource/Camp_Nou> . ?uri <http://dbpedia.org/property/youthclubs> ?x  . }"
    },
    {
        "uid": "2146",
        "question": "Name everyone working for a company owned by Roman Abramovich.",
        "verbalized_answer": "The people working for a company owned by Roman Abramovich are [Roman Abramovich, Alexander Vladimirovich Frolov].",
        "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/owningCompany> <http://dbpedia.org/resource/Roman_Abramovich> . ?uri <http://dbpedia.org/ontology/occupation> ?x  . }"
    },
    {
        "uid": "73",
        "question": "List the base currency of the country whose anthem is Oj, svijetla majska zoro.",
        "verbalized_answer": "The currencies of the country whose anthem is Oj, svijetla majska zoro are [Euro b, Euro, Yugoslav dinar, Deutsche Mark].",
        "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/anthem> <http://dbpedia.org/resource/Oj,_svijetla_majska_zoro> . ?x <http://dbpedia.org/property/currency> ?uri  . }"
    },
    {
        "uid": "29",
        "question": "Who is the common manager of Aston Villa 2000-01 season and also the manager of Middlesbrough F.C. season 2009-10",
        "verbalized_answer": "[Gareth Southgate] is the manager of Aston Villa 2000-01 season and Middlesbrough 2009-10 season.",
        "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/2000–01_Aston_Villa_F.C._season> <http://dbpedia.org/property/name> ?uri. <http://dbpedia.org/resource/2009–10_Middlesbrough_F.C._season> <http://dbpedia.org/ontology/manager> ?uri}"
    },
    {
        "uid": "1739",
        "question": "Give me some software which run on mac os.",
        "verbalized_answer": "The software which run on Mac OS are [answer].",
        "query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/operatingSystem> <http://dbpedia.org/resource/Mac_OS>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Software>}"
    },
    {
        "uid": "4048",
        "question": "List the sports played in private universities.",
        "verbalized_answer": "The sports played in private universities are [answer].",
        "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/type> <http://dbpedia.org/resource/Private_university> . ?x <http://dbpedia.org/ontology/sport> ?uri  . }"
    },
    {
        "uid": "4198",
        "question": "List the alma mater of the person who is wedded to Sissela Bok.",
        "verbalized_answer": "The alma maters of the person whose spouse is Sissela Bok are [Stanford University, George Washington University, Harvard Law School].",
        "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/spouse> <http://dbpedia.org/resource/Sissela_Bok> . ?x <http://dbpedia.org/property/almaMater> ?uri  . }"
    },
    {
        "uid": "1273",
        "question": "List all the tenants of the stadium where the WWF Summer Slam 2004 took place.",
        "verbalized_answer": "The tenants of the venue of SummerSlam 2004 are [Toronto Rock, Toronto Phantoms, Raptors 905, Toronto Maple Leafs, Toronto Raptors, Toronto Marlies].",
        "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/SummerSlam_(2004)> <http://dbpedia.org/property/venue> ?x . ?x <http://dbpedia.org/ontology/tenant> ?uri  . }"
    },
    {
        "uid": "1226",
        "question": "Count the number of judges who've come on CTV network shows.",
        "verbalized_answer": "There are [21] judges in television shows whose network is CTV.",
        "query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/network> <http://dbpedia.org/resource/CTV_Television_Network> . ?x <http://dbpedia.org/property/judges> ?uri  . }"
    },
    {
        "uid": "1651",
        "question": "List the first drivers of Grand Prixes where Mika Hakkinen was a pole driver.",
        "verbalized_answer": "The first drivers of the Grand Prixes where Mika Hakkinen was in pole position are [Michael Schumacher, Jacques Villeneuve, Mika Häkkinen, Damon Hill, Eddie Irvine, David Coulthard, Heinz-Harald Frentzen].",
        "query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/poleDriver> <http://dbpedia.org/resource/Mika_Häkkinen> . ?x <http://dbpedia.org/ontology/firstDriver> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/GrandPrix>}"
    },
    {
        "uid": "445",
        "question": "What is the death place of the Elbieta Czartoryska which is also place of birth of the Charles Journet",
        "verbalized_answer": "The death place of the Elbieta Czartoryska and place of birth of Charles Journet is [Geneva, Switzerland].",
        "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Elżbieta_Czartoryska_(1905–1989)> <http://dbpedia.org/property/deathPlace> ?uri. <http://dbpedia.org/resource/Charles_Journet> <http://dbpedia.org/ontology/birthPlace> ?uri}"
    },
    {
        "uid": "30",
        "question": "Name the mascot of the military branch of William Harper.",
        "verbalized_answer": "The mascot of the military branch of William Harper is [Kangaroo].",
        "query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/William_Harper_(Rhodesian_politician)> <http://dbpedia.org/ontology/militaryBranch> ?x . ?x <http://dbpedia.org/property/mascot> ?uri  . }"
    },
    {
        "uid": "4774",
        "question": "Is Serbian Titieca a doctoral student of Werner Heisenberghttp://dbpedia.org/resource/Werner_Heisenberg",
        "verbalized_answer": "[Yes], Serban ieica is the doctoral student of Werner Heisenberg.",
        "query": "ASK WHERE { <http://dbpedia.org/resource/Werner_Heisenberg> <http://dbpedia.org/ontology/doctoralStudent> <http://dbpedia.org/resource/Șerban_Țițeica> }"
    }
]